examples/workflows/parametric_sweep/solution_foam_dict/base_case_1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          ( 3 0 0 );

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 3 0 0 );

boundaryField
{
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform $Uinlet;
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( 3 0 0 );
    }
    ".*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
